03 ACCOUNT-DATA.
  05 ACCOUNT-EYE-CATCHER        PIC X(4).
  88 ACCOUNT-EYECATCHER-VALUE        VALUE 'ACCT'.
  05 ACCOUNT-CUST-NO            PIC 9(10).
  05 ACCOUNT-KEY.
     07 ACCOUNT-SORT-CODE       PIC 9(6).
     07 ACCOUNT-NUMBER          PIC 9(8).
  05 ACCOUNT-TYPE               PIC X(8).
  05 ACCOUNT-INTEREST-RATE      PIC 9(4)V99.
  05 ACCOUNT-OPENED             PIC 9(8).
  05 ACCOUNT-OVERDRAFT-LIMIT    PIC 9(8).
  05 ACCOUNT-LAST-STMT-DATE     PIC 9(8).
  05 ACCOUNT-NEXT-STMT-DATE     PIC 9(8).
  05 ACCOUNT-AVAILABLE-BALANCE  PIC S9(10)V99.
  05 ACCOUNT-ACTUAL-BALANCE     PIC S9(10)V99.
